"""
  Автор: Коновалов Николай, группа №P3355

    Учтены все формы склонений
"""

data = [

    ["первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое",
     "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое",
     "семнадцатое", "восемнадцатое",
     "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье",
     "двадцать четвертое", "двадцать пятое", "двадать шестое", "двадцать седьмое", "двадцать восьмое",
     "двадцать девятое", "тридцатое", "тридцать первое"],

    ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября",
     "декабря"],

    ["тысяча", "две тысячи", "три тысячи", "четыре тысячи", "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч",
     "девять тысяч"],

    ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"],

    ["нулевого", "первого", "второго", "третьего", "четвертого", "пятого", "шестого", "седьмого", "восьмого",
     "девятого"],

    ["тысячного", "двухтысячного", "трехтысячного", "четерехтысячного", "пятитысячного", "шеститысячного",
     "семитысячного", "восьмитысячного", "девятитысячного", "нулевого"],

    ["сотого", "двухсотого", "трехсотого", "четырехсотого", "пятисотого", "шестисотого", "семисотого", "восьмисотого",
     "девятисотого"],

    ["десятого", "двадцатого", "тринадцатого", "сорокового", "пятидесятого", "шестидесятого", "семидесятого",
     "восьмидесятого", "девяностого"],

    ["одиннадцатого", "двенадцатого", "тринадцатого", "четырнадцатого", "пятнадцатого", "шестнадцатого", "семнадцатого", "девятнадцатого"],

    ["десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"],

    ["ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать",
     "восемнадцать", "девятнадцать", "двадцать", "двадцать один", "двадцать два", "двадцать три", "двадцать четыре"],

    ["ноль", "одна", "две", "четыре", "пять", "шесть", "семь", "восемь", "девять"]
]


def convert(d):

    # 'третье ноября одна тысяча восемьсот двенадцатого года двадцать один час ноль минут ноль секунд'
    d = (d.replace(".", " ").replace(":", " ").split())

    res = [data[0][int(d[0]) - 1], data[1][int(d[1]) - 1]]

    year = [int(x) for x in str(d[2])]


    if int(d[2]) % 1000 == 0:  # кейс: тысячные года
        res.append(data[5][year[0] - 1])
        if (year[2] == 0 and year[3] == 0) and year[1] != 0:
            res.append(data[6][year[1] - 1])

    else:
        if int(d[2]) % 100 == 0:  # кейс: сотые года
            if year[0] != 0:
                res.append(data[2][year[0] - 1] if year[0] != 0 else "")
            res.append(data[6][year[1] - 1])
        else:
            res.append(data[2][year[0] - 1] if year[0] != 0 else "")

            res.append(data[3][year[1] - 1] if (year[1] != 0) else "")

            if year[2] > 1 and year[3] != 0:
                res.append(data[9][year[2] - 1])

            if year[3] == 0 and year[2] != 0:
                res.append(data[7][year[2] - 1])

            if year[2] == 1 and year[3] != 0:
                res.append(data[8][year[3] - 1])
            elif year[3] != 0:
                res.append(data[4][year[3]])

    res.append("года")

    res.append(data[10][int(d[3])])

    if int(d[3]) == 0 or int(d[3]) >= 5 and int(d[3]) <= 20:
        res.append("часов")
    elif int(d[3]) == 1 or int(d[3]) == 21 :
        res.append("час")
    else:
        res.append("часа")

    if int(d[4]) < 2:
        res.append(data[11][int(d[4])])
    elif int(d[4]) > 2 and  int(d[4]) <= 19:
        res.append(data[10][int(d[4])])
    else:
        res.append(data[9][int(d[4][0])- 1])
        if int(d[4][1]) != 0:
            res.append(data[11][int(d[4][1])])
    if ((int(d[4]) % 10 == 2) or (int(d[4]) % 10 == 3) or (int(d[4]) % 10 == 4)) and (int(d[4][0]) != 1):
        res.append("минуты")
    elif int(d[4]) % 10 == 1:
        res.append("минута")
    else:
        res.append("минут")

    if int(d[5]) < 2:
        res.append(data[11][int(d[5])])
    elif int(d[5]) > 2 and  int(d[5]) <= 19:
        res.append(data[10][int(d[5])])
    else:
        res.append(data[9][int(d[5][0])- 1])
        if int(d[5][1]) != 0:
            res.append(data[11][int(d[5][1]) -1 ])

    if ((int(d[5]) % 10 == 2) or (int(d[5]) % 10 == 3) or (int(d[5]) % 10 == 4)) and (int(d[5][0]) != 1):
        res.append("секунды")
    elif int(d[5]) % 10 == 1:
        res.append("секунда")
    else:
        res.append("секунд")

    # хак удаляет лишнии пробелы
    res = ' '.join(res)
    res = res.split()
    res = ' '.join(res)

    return res


# юниты
if __name__ == '__main__':
    assert convert("30.02.0010 15:21:50") == 'тридцатое февраля десятого года пятнадцать часов двадцать одна минута пятьдесят секунд'
    assert convert("17.01.9999 11:10:36") == 'семнадцатое января девять тысяч девятьсот девяносто девятого года одиннадцать часов десять минут тридцать шесть секунд'
    assert convert("03.02.1000 00:00:00") == 'третье февраля тысячного года ноль часов ноль минут ноль секунд'
    assert convert("31.02.0015 09:11:40") == 'тридцать первое февраля пятнадцатого года девять часов одиннадцать минута сорок секунд'
    assert convert("14.06.0000 00:00:00") == 'четырнадцатое июня нулевого года ноль часов ноль минут ноль секунд'