"""
  Автор: Коновалов Николай, группа №__

"""

data = [

    ["первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое",
     "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое",
     "семнадцатое", "восемнадцатое",
     "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье",
     "двадцать четвертое", "двадцать пятое", "двадать шестое", "двадцать седьмое", "двадцать восьмое",
     "двадцать девятое", "тридцатое", "тридцать первое"],
    ["января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября",
     "декабря"],
    ["тысяча", "две тысячи", "три тысячи", "четыре тысячи", "пять тысяч", "шесть тысяч", "семь тысяч", "восемь тысяч",
     "девять тысяч"],
    ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"],
    ["десятого", "двадцатого", "тридцатого", "четырнадцатого", "пятнадцатого", "шестнадцатого", "сем",
     "восьмидесятого", "девяностого"],



    ["час", "часов", "часа"],
    ["минута", "минут", "минуты"],
    ["секунд", "секунда", "секудны"],
    ["тысяча", "тысяч", "тысячи"],
    ["одна"],
    ["сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"],
    ["десять", "двенадцать", "тринадцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"],
    ["десятого", "двадцатого", "тридцатого", "сорокового", "пятидесятого", "шестидесятого", "семидесятого",
     "восьмидесятого", "девяностого"],
    ["нулевого", "первого", "второго", "третьего", "четвертого", "пятого", "шестого", "седьмого", "восьмого",
     "девятого"],
    ["одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать",
     "восемнадцать", "девятнадцать"],
    ["двух", "трех", "четырех", "пяти", "шести", "семи", "восьми", "девяти"]

]

d = "03.11.1812 21:00:00"
# 'третье ноября одна тысяча восемьсот двенадцатого года двадцать один час ноль минут ноль секунд'
d = [int(x) for x in (d.replace(".", " ").replace(":", " ").split())]


print(data[0][d[0] - 1])
print(data[1][d[1] - 1])

year = [int(x) for x in str(d[2])]

print(data[2][year[0] - 1])

print(year)

print(data[4][year[2] + year[3] - 1] if year[2] == 1 else 'False')
